{
  "composers": [
    {
      "id": "aaron-copland",
      "name": "Aaron Copland",
      "era": ["20th-21st Century"],
      "birthYear": 1900,
      "deathYear": 1990,
      "shortBio": "Aaron Copland was an American composer, teacher, and conductor. He is known for creating a distinctly American style of classical music. His works often incorporate folk themes and open, spacious harmonies.",
      "longBio": "Aaron Copland (1900–1990) was a prominent American composer who played a pivotal role in shaping 20th-century American classical music. He was born in Brooklyn, New York, and studied in Paris with Nadia Boulanger. Copland is best known for works such as 'Appalachian Spring,' 'Fanfare for the Common Man,' and 'Rodeo.' His music is characterized by its incorporation of American folk elements and a sense of wide-open space. Copland also wrote film scores, including 'Of Mice and Men' and 'The Heiress,' for which he won an Academy Award. As a teacher and writer, he influenced generations of American musicians. He received many honors, including the Pulitzer Prize and the Presidential Medal of Freedom.",
      "nationality": "American",
      "location": "New York, USA",
      "famousWorks": [
        "Appalachian Spring",
        "Fanfare for the Common Man",
        "Rodeo"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/0/05/Aaron_Copland_1970.JPG"
    },
    {
      "id": "adolphe-adam",
      "name": "Adolphe Adam",
      "era": ["Romantic"],
      "birthYear": 1803,
      "deathYear": 1856,
      "shortBio": "Adolphe Adam was a French composer and music critic of the Romantic era. He is best known for his ballets and operas, including 'Giselle' and 'Le Corsaire.' Adam also composed the famous Christmas carol 'O Holy Night.'",
      "longBio": "Adolphe Charles Adam (1803–1856) was a prolific French composer of the 19th century. Born in Paris, he studied at the Paris Conservatoire and became renowned for his stage works. Adam composed more than 80 operas and numerous ballets, with 'Giselle' being his most enduring ballet. He was also a noted music critic and teacher. His opera 'Le postillon de Lonjumeau' and the ballet 'Le Corsaire' remain popular. Adam composed the beloved Christmas carol 'Minuit, chrétiens' ('O Holy Night'). He died in Paris, leaving a significant legacy in French music.",
      "nationality": "French",
      "location": "Paris, France",
      "famousWorks": [
        "Giselle",
        "Le Corsaire",
        "O Holy Night"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/26/Adolphe_Adam_by_Maurin.jpg"
    },
    {
      "id": "alexander-glazunov",
      "name": "Alexander Glazunov",
      "era": ["Romantic", "20th-21st Century"],
      "birthYear": 1865,
      "deathYear": 1936,
      "shortBio": "Alexander Glazunov was a Russian composer, conductor, and music teacher. He bridged the late Russian Romantic period and early 20th-century music. Glazunov was director of the Saint Petersburg Conservatory for over two decades.",
      "longBio": "Alexander Konstantinovich Glazunov (1865–1936) was a prominent Russian composer and conductor. He was born in Saint Petersburg and studied under Rimsky-Korsakov. Glazunov became known for his symphonies, ballets, and concertos, blending Russian nationalism with Western influences. In 1905, he was appointed director of the Saint Petersburg Conservatory, where he reformed and modernized the institution. Glazunov helped many young composers, including Shostakovich. He emigrated from Russia in 1928 but continued to compose and conduct in Europe. Glazunov's music remains a staple of the concert repertoire. He was a prolific composer, writing nine symphonies and numerous chamber works. His legacy extends beyond his compositions, as he played a significant role in shaping Czech musical life.",
      "nationality": "Russian",
      "location": "Saint Petersburg, Russia",
      "famousWorks": [
        "The Seasons",
        "Violin Concerto in A minor",
        "Symphony No. 5"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Glazunov_by_Repin.jpg"
    },
    {
      "id": "alma-mahler",
      "name": "Alma Mahler",
      "era": ["Romantic", "20th-21st Century"],
      "birthYear": 1879,
      "deathYear": 1964,
      "shortBio": "Alma Mahler was an Austrian composer, author, and socialite. She was known for her relationships with prominent artists and her own musical talent. Alma composed songs and was a central figure in Viennese cultural life.",
      "longBio": "Alma Mahler (1879–1964) was born in Vienna and showed early musical promise. She studied composition with Alexander von Zemlinsky and wrote nearly fifty songs. Alma married composer Gustav Mahler, who discouraged her composing, but she later resumed her work. After Mahler's death, she was romantically involved with painter Oskar Kokoschka and architect Walter Gropius, whom she married. She later married writer Franz Werfel and emigrated to the United States during World War II. Alma's salons in Vienna and later in Los Angeles attracted leading artists and intellectuals. Her life and relationships have been the subject of much literary and artistic interest.",
      "nationality": "Austrian",
      "location": "Vienna, Austria",
      "famousWorks": [
        "Die stille Stadt",
        "Fünf Lieder",
        "Vier Lieder"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/14/Alma_Mahler_with_Maria_and_Anna.jpg"
    },
    {
      "id": "amy-beach",
      "name": "Amy Beach",
      "era": ["Romantic"],
      "birthYear": 1867,
      "deathYear": 1944,
      "shortBio": "Amy Beach was an American composer and pianist. She was the first successful American female composer of large-scale art music. Beach's works include symphonies, chamber music, and songs.",
      "longBio": "Amy Marcy Cheney Beach (1867–1944) was a pioneering American composer and pianist. Born in New Hampshire, she showed prodigious musical talent as a child. Beach made her professional debut as a pianist at age 16 and soon turned to composition. Her 'Gaelic' Symphony was the first symphony composed and published by an American woman. Beach was largely self-taught as a composer, drawing on European Romantic traditions. She was active in Boston's musical circles and advocated for women in music. Beach's legacy endures in her extensive catalog of orchestral, choral, and solo works. She was a prolific composer, writing over 150 works during her lifetime. Beach's music is characterized by its lyricism and technical skill.",
      "nationality": "American",
      "location": "Boston, USA",
      "famousWorks": [
        "Gaelic Symphony",
        "Piano Concerto in C-sharp minor",
        "Mass in E-flat major"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/3/38/Amy_Beach_01.jpg"
    },
    {
      "id": "antonio-salieri",
      "name": "Antonio Salieri",
      "era": ["Classical"],
      "birthYear": 1750,
      "deathYear": 1825,
      "shortBio": "Antonio Salieri was an Italian classical composer and conductor. He was a leading figure in Viennese musical life in the late 18th and early 19th centuries. Salieri taught many famous composers, including Beethoven and Schubert.",
      "longBio": "Antonio Salieri (1750–1825) was born in Legnago, Italy, and moved to Vienna as a teenager. He became the court composer and conductor for the Habsburg monarchy. Salieri wrote over forty operas, as well as sacred and instrumental music. He was a respected teacher, mentoring composers such as Beethoven, Schubert, and Liszt. Salieri's reputation suffered due to rumors of rivalry with Mozart, though modern scholarship has largely dispelled these myths. He remained active in Vienna's musical life until his death. Salieri's music is now being rediscovered and appreciated for its craftsmanship. He was a prolific composer, writing over 40 operas and numerous instrumental works. Salieri's legacy extends beyond his compositions, as he played a significant role in shaping Viennese musical life.",
      "nationality": "Italian",
      "location": "Vienna, Austria",
      "famousWorks": [
        "Europa riconosciuta",
        "La grotta di Trofonio",
        "Prima la musica e poi le parole"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/0/07/Antonio_Salieri_painted_by_Joseph_Willibrord_M%C3%A4hler.jpg"
    },
    {
      "id": "antonin-dvorak",
      "name": "Antonín Dvořák",
      "era": ["Romantic"],
      "birthYear": 1841,
      "deathYear": 1904,
      "shortBio": "Antonín Dvořák was a Czech composer of the Romantic era. He is best known for his 'New World Symphony' and his use of folk music. Dvořák's works are celebrated for their melodic richness and national character.",
      "longBio": "Antonín Leopold Dvořák (1841–1904) was born in Nelahozeves, Bohemia (now Czech Republic). He studied music in Prague and gained recognition with his Slavonic Dances. Dvořák's compositions include symphonies, chamber music, operas, and choral works. In 1892, he became director of the National Conservatory of Music in New York City. While in America, he composed the 'New World Symphony,' inspired by African American and Native American music. Dvořák returned to Prague in 1895 and continued to compose until his death. His music remains central to the orchestral and chamber repertoire. Dvořák was a prolific composer, writing nine symphonies and numerous chamber works. His legacy extends beyond his compositions, as he played a significant role in shaping Czech musical life.",
      "famousWorks": [
        "Symphony No. 9 'From the New World'",
        "Rusalka",
        "Slavonic Dances"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/0/04/Dvorak_1868.jpg"
    },
    {
      "id": "aram-khachaturian",
      "name": "Aram Khachaturian",
      "era": ["20th-21st Century"],
      "birthYear": 1903,
      "deathYear": 1978,
      "shortBio": "Aram Khachaturian was a Soviet Armenian composer and conductor. He is renowned for his vibrant orchestral works and ballets, notably 'Spartacus' and 'Gayane.' Khachaturian's 'Sabre Dance' is one of the most recognizable pieces of 20th-century classical music.",
      "longBio": "Aram Khachaturian (1903–1978) was born in Tbilisi, Georgia, to Armenian parents. He studied at the Moscow Conservatory and became a leading Soviet composer. Khachaturian's music is known for its rhythmic vitality, colorful orchestration, and incorporation of Armenian folk themes. His ballets 'Gayane' and 'Spartacus' achieved international acclaim, with the 'Sabre Dance' from 'Gayane' becoming especially famous. He also composed symphonies, concertos, and film music. Khachaturian was an influential teacher and cultural figure in the Soviet Union. He received numerous honors, including the title of People's Artist of the USSR.",
      "nationality": "Armenian",
      "location": "Moscow, USSR",
      "famousWorks": [
        "Spartacus",
        "Gayane (including Sabre Dance)",
        "Violin Concerto"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/d/d6/Aankomst_Russische_dirigent_Khatsjatoerian_op_Schiphol%2C_Khatsjatorian%2C_Bestanddeelnr_916-6862.jpg"
    },
    {
      "id": "arnold-schoenberg",
      "name": "Arnold Schoenberg",
      "era": ["20th-21st Century"],
      "birthYear": 1874,
      "deathYear": 1951,
      "shortBio": "Arnold Schoenberg was an Austrian composer, music theorist, and painter. He is best known for developing the twelve-tone technique and atonal music. Schoenberg's innovations had a profound impact on 20th-century music.",
      "longBio": "Arnold Schoenberg (1874–1951) was born in Vienna and began his musical career as a self-taught composer. He initially wrote in the late Romantic style before pioneering atonality and the twelve-tone method. Schoenberg's major works include 'Verklärte Nacht,' 'Pierrot Lunaire,' and his String Quartets. He emigrated to the United States in 1933 to escape Nazi persecution. In America, he taught at UCLA and continued to compose, influencing generations of composers. Schoenberg was also a painter and associated with the Expressionist movement. His theoretical writings and teaching reshaped modern music.",
      "nationality": "Austrian-American",
      "location": "Vienna, Austria and Los Angeles, USA",
      "famousWorks": [
        "Pierrot Lunaire",
        "Verklärte Nacht",
        "Moses und Aron"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Arnold_sch%C3%B6nberg_man_ray.jpg"
    },
    {
      "id": "bela-bartok",
      "name": "Béla Bartók",
      "era": ["20th-21st Century"],
      "birthYear": 1881,
      "deathYear": 1945,
      "shortBio": "Béla Bartók was a Hungarian composer, pianist, and ethnomusicologist. He is recognized for integrating folk music into classical compositions. Bartók is considered one of the most important composers of the 20th century.",
      "longBio": "Béla Bartók (1881–1945) was born in Nagyszentmiklós, Austria-Hungary (now Romania). He studied piano and composition at the Royal Academy of Music in Budapest. Bartók collected and incorporated Eastern European folk music into his works, creating a distinctive style. His major compositions include six string quartets, the Concerto for Orchestra, and 'Music for Strings, Percussion and Celesta.' Bartók emigrated to the United States in 1940 due to World War II. He continued composing and teaching in America, despite financial and health difficulties. Bartók's legacy endures through his innovative music and ethnomusicological research.",
      "nationality": "Hungarian",
      "location": "Budapest, Hungary",
      "famousWorks": [
        "Music for Strings, Percussion and Celesta",
        "Concerto for Orchestra",
        "Mikrokosmos"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/d/d2/Bart%C3%B3k_B%C3%A9la_1927_%28cropped%29.jpg"
    },
    {
      "id": "camille-saint-saens",
      "name": "Camille Saint-Saëns",
      "era": ["Romantic"],
      "birthYear": 1835,
      "deathYear": 1921,
      "shortBio": "Camille Saint-Saëns was a French composer, organist, conductor, and pianist of the Romantic era. He is known for works like 'The Carnival of the Animals' and 'Danse Macabre.' Saint-Saëns was a prolific and versatile musician.",
      "longBio": "Charles-Camille Saint-Saëns (1835–1921) was born in Paris and showed early musical talent. He studied at the Paris Conservatoire and became a renowned organist and pianist. Saint-Saëns composed symphonies, concertos, operas, and chamber music, with 'Samson and Delilah' and 'The Carnival of the Animals' among his best-known works. He was a champion of French music and supported younger composers like Fauré and Debussy. Saint-Saëns traveled widely and was celebrated internationally. His music is admired for its clarity, elegance, and craftsmanship. He remained active as a composer and performer until his death at age 86.",
      "nationality": "French",
      "location": "Paris, France",
      "famousWorks": [
        "The Carnival of the Animals",
        "Symphony No. 3 (Organ Symphony)",
        "Danse Macabre"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/9/98/Saint-Sa%C3%ABns-circa-1880.jpg"
    },
    {
      "id": "carl-philipp-emanuel-bach",
      "name": "Carl Philipp Emanuel Bach",
      "era": ["Classical"],
      "birthYear": 1714,
      "deathYear": 1788,
      "shortBio": "Carl Philipp Emanuel Bach was a German composer and musician of the Classical period. He was the second surviving son of Johann Sebastian Bach. C.P.E. Bach was influential in the transition from Baroque to Classical music.",
      "longBio": "Carl Philipp Emanuel Bach (1714–1788) was born in Weimar, Germany, and was the fifth child of J.S. Bach. He studied law but pursued a musical career, serving as court musician for Frederick the Great in Berlin. Later, he became music director in Hamburg, succeeding his godfather Telemann. C.P.E. Bach composed symphonies, concertos, keyboard works, and choral music, pioneering the empfindsamer Stil (sensitive style). His treatise 'Essay on the True Art of Playing Keyboard Instruments' was highly influential. Bach's expressive and innovative music bridged the Baroque and Classical eras. He was admired by Haydn, Mozart, and Beethoven.",
      "nationality": "German",
      "location": "Hamburg, Germany",
      "famousWorks": [
        "Magnificat",
        "Keyboard Sonatas",
        "Hamburg Symphonies"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/19/CPEB_by_L%C3%B6hr.jpg"
    },
    {
      "id": "carl-nielsen",
      "name": "Carl Nielsen",
      "era": ["Romantic", "20th-21st Century"],
      "birthYear": 1865,
      "deathYear": 1931,
      "shortBio": "Carl Nielsen was a Danish composer, conductor, and violinist. He is regarded as Denmark’s most prominent composer. Nielsen is best known for his six symphonies and his innovative approach to musical form.",
      "longBio": "Carl August Nielsen (1865–1931) was born on the island of Funen, Denmark, to a musical but poor family. He began his career playing in a military band and later studied at the Royal Danish Academy of Music. Nielsen played violin in the Royal Danish Orchestra and was influenced by the music of Wagner and Brahms. He composed six symphonies, concertos, operas, and chamber music, with the Fourth and Fifth Symphonies being especially notable. Nielsen’s music is characterized by its progressive tonality, rhythmic vitality, and originality. He also served as conductor of the Royal Danish Orchestra and director of the Copenhagen Conservatory. His legacy is central to Danish musical life and internationally recognized.",
      "nationality": "Danish",
      "location": "Copenhagen, Denmark",
      "famousWorks": [
        "Symphony No. 4 (The Inextinguishable)",
        "Symphony No. 5",
        "Wind Quintet"
      ],
      "imageUrl":
        "https://upload.wikimedia.org/wikipedia/commons/5/5d/Carl_Nielsen_c._1908_-_Restoration.jpg"
    },
    {
      "id": "cecile-chaminade",
      "name": "Cécile Chaminade",
      "era": ["Romantic"],
      "birthYear": 1857,
      "deathYear": 1944,
      "shortBio": "Cécile Chaminade was a French composer and pianist of the late Romantic era. She achieved great popularity in France and England for her piano pieces and songs. Chaminade was one of the first female composers to gain international recognition. She was known for her lyrical and charming music.",
      "longBio": "Cécile Louise Stéphanie Chaminade (1857–1944) was born in Paris and showed musical talent from an early age. She studied privately with prominent teachers, as the Paris Conservatoire did not admit women at the time. Chaminade composed over 400 works, including piano pieces, songs, and orchestral music. Her ‘Concertstück’ for piano and orchestra and ‘Scarf Dance’ are among her most famous works. She toured extensively in Europe and the United States, receiving widespread acclaim. In 1913, she was awarded the Légion d’Honneur, a rare honor for a female musician. Chaminade’s music is noted for its lyricism and charm. She was a prolific composer, writing music in various genres.",
      "nationality": "French",
      "location": "Paris, France",
      "famousWorks": [
        "Concertino for Flute",
        "Les Sylvains",
        "Automne"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Cecile_chaminade.jpg"
    },
    {
      "id": "chevalier-de-saint-georges",
      "name": "Chevalier de Saint-Georges",
      "era": ["Classical"],
      "birthYear": 1745,
      "deathYear": 1799,
      "shortBio": "Chevalier de Saint-Georges was a French composer, violinist, and conductor of African descent. He was renowned for his virtuosity and leadership of Parisian orchestras. Saint-Georges was also a champion fencer and a prominent figure in French society. He was a true Renaissance man.",
      "longBio": "Joseph Bologne, Chevalier de Saint-Georges (1745–1799) was born in Guadeloupe to a wealthy planter and an enslaved African woman. He moved to France as a child and received an elite education. Saint-Georges became famous as a violinist, conductor, and composer, writing symphonies, concertos, and operas. He led the Concert des Amateurs, one of Europe’s finest orchestras. In addition to his musical achievements, he was a celebrated fencer and served as a colonel in the French Revolution. Saint-Georges faced racial prejudice but overcame barriers to achieve great success. He is recognized as the first known classical composer of African descent. His legacy extends beyond music to the world of fencing and politics.",
      "nationality": "French",
      "location": "Paris, France",
      "famousWorks": [
        "Symphony No. 1 in G major",
        "Violin Concertos",
        "L'Amant anonyme"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/0/02/Mather_Brown%2C_William_Ward_-_Monsieur_de_St_George%2C_1788%2C_NPG_D4132%2C_London.png"
    },
    {
      "id": "christoph-willibald-gluck",
      "name": "Christoph Willibald Gluck",
      "era": ["Classical"],
      "birthYear": 1714,
      "deathYear": 1787,
      "shortBio": "Christoph Willibald Gluck was a German composer of the Classical period. He is best known for his operatic reforms and masterpieces like ‘Orfeo ed Euridice.’ Gluck’s innovations had a lasting influence on opera. He was a key figure in the development of opera seria.",
      "longBio": "Christoph Willibald Gluck (1714–1787) was born in Erasbach, Bavaria, and studied music in Prague and Vienna. He became a leading opera composer in Europe, writing for courts in Vienna, Paris, and Naples. Gluck’s operatic reforms emphasized dramatic expression and naturalness over virtuosic display. His most famous works include ‘Orfeo ed Euridice,’ ‘Alceste,’ and ‘Iphigénie en Tauride.’ Gluck collaborated with librettist Ranieri de’ Calzabigi to create a new style of opera. His influence extended to composers like Mozart and Berlioz. Gluck’s legacy endures in the history of opera. He was a prolific composer, writing over 100 works during his lifetime. His music is still performed today.",
      "nationality": "German",
      "location": "Vienna, Austria",
      "famousWorks": [
        "Orfeo ed Euridice",
        "Alceste",
        "Iphigénie en Tauride"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/9/91/Joseph_Siffred_Duplessis_-_Christoph_Willibald_Gluck_-_Google_Art_Project.jpg"
    },
    {
      "id": "clara-schumann",
      "name": "Clara Schumann",
      "era": ["Romantic"],
      "birthYear": 1819,
      "deathYear": 1896,
      "shortBio": "Clara Schumann was a German pianist, composer, and teacher of the Romantic era. She was one of the most distinguished pianists of her time. Clara composed piano, chamber, and vocal music and was a champion of her husband Robert Schumann’s works. She was a pioneering female musician.",
      "longBio": "Clara Schumann (1819–1896) was born in Leipzig, Germany, and was a child prodigy on the piano. She studied with her father, Friedrich Wieck, and began touring Europe at a young age. Clara married composer Robert Schumann and had eight children. Despite personal and professional challenges, she maintained a successful performing career for over 60 years. Clara composed piano pieces, songs, and chamber music, though her output was limited by societal expectations. She was a close friend of Johannes Brahms and promoted the music of Robert Schumann and other contemporaries. Clara Schumann is celebrated as a pioneering female musician in the 19th century. Her legacy extends beyond music to the world of education and advocacy.",
      "nationality": "German",
      "location": "Leipzig, Germany",
      "famousWorks": [
        "Piano Concerto in A minor",
        "Piano Trio in G minor",
        "Three Romances for Violin and Piano"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/b/bc/Robert_and_Clara_Schumann_Daguerrotype_%28cropped%29.jpg"
    },
    {
      "id": "claude-debussy",
      "name": "Claude Debussy",
      "era": ["20th-21st Century"],
      "birthYear": 1862,
      "deathYear": 1918,
      "shortBio": "Claude Debussy was a French composer associated with Impressionist music. He is known for his innovative harmonies and evocative, atmospheric works. Debussy’s music marked a turning point in the transition from Romanticism to modernism.",
      "longBio": "Claude Debussy (1862–1918) was born in Saint-Germain-en-Laye, France, and studied at the Paris Conservatoire. He won the Prix de Rome in 1884 and became known for his unique approach to harmony and form. Debussy’s works, such as ‘Clair de Lune,’ ‘La Mer,’ and ‘Prélude à l’après-midi d’un faune,’ are celebrated for their impressionistic qualities and subtle orchestration. He rejected the ‘Impressionist’ label but profoundly influenced 20th-century music. Debussy’s opera ‘Pelléas et Mélisande’ is considered a masterpiece of French opera. He was a key figure in Parisian artistic circles and collaborated with poets and painters. Debussy’s legacy endures as one of the most original voices in classical music.",
      "nationality": "French",
      "location": "Paris, France",
      "famousWorks": [
        "Clair de Lune",
        "Prélude à l'après-midi d'un faune",
        "La Mer"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Claude_Debussy_ca_1908%2C_foto_av_F%C3%A9lix_Nadar.jpg"
    },
    {
      "id": "claudio-monteverdi",
      "name": "Claudio Monteverdi",
      "era": ["Baroque"],
      "birthYear": 1567,
      "deathYear": 1643,
      "shortBio": "Claudio Monteverdi was an Italian composer, gambist, and singer of the late Renaissance and early Baroque periods. He is considered a pioneer of opera and a master of both sacred and secular music. Monteverdi’s works mark the transition from Renaissance to Baroque style.",
      "longBio": "Claudio Monteverdi (1567–1643) was born in Cremona, Italy, and studied music from an early age. He began his career as a court musician in Mantua and later served as maestro di cappella at St. Mark’s Basilica in Venice. Monteverdi composed madrigals, sacred music, and some of the earliest operas, including ‘L’Orfeo’ and ‘L’incoronazione di Poppea.’ His music is known for its expressive power and innovative use of harmony and orchestration. Monteverdi played a crucial role in the development of opera as an art form. He bridged the gap between the Renaissance and Baroque eras. Monteverdi’s influence is still felt in modern vocal and dramatic music. He was a prolific composer, writing music in various genres. Monteverdi’s legacy endures as one of the most important figures in the history of music.",
      "nationality": "Italian",
      "location": "Venice, Italy",
      "famousWorks": [
        "L'Orfeo",
        "Vespers of 1610",
        "L'incoronazione di Poppea"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/0/02/Bernardo_Strozzi_-_Claudio_Monteverdi_%28c.1630%29.jpg"
    },
    {
      "id": "dieterich-buxtehude",
      "name": "Dieterich Buxtehude",
      "era": ["Baroque"],
      "birthYear": 1637,
      "deathYear": 1707,
      "shortBio": "Dieterich Buxtehude was a German-Danish organist and composer of the Baroque period. He is renowned for his organ works and sacred vocal music. Buxtehude’s music greatly influenced later composers, including J.S. Bach.",
      "longBio": "Dieterich Buxtehude (c. 1637–1707) was born in Helsingborg or Oldesloe and spent most of his career in Lübeck, Germany. He served as organist at the Marienkirche in Lübeck, where his Abendmusiken concerts became famous. Buxtehude composed numerous works for organ, harpsichord, and voices, including cantatas and chorale settings. His music is characterized by expressive melodies, inventive counterpoint, and dramatic contrasts. J.S. Bach famously walked over 250 miles to hear Buxtehude play. Buxtehude’s influence extended throughout northern Europe, shaping the development of Baroque music. He was a master of the organ and a prolific composer. Buxtehude’s legacy remains significant in the history of music. He was a key figure in the development of the Lutheran chorale. Buxtehude’s music is still performed today.",
      "nationality": "Danish-German",
      "location": "Lübeck, Germany",
      "famousWorks": [
        "Membra Jesu Nostri",
        "Praeludium in G minor",
        "Passacaglia in D minor"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Imagebuxtehude.jpg"
    },
    {
      "id": "dmitri-shostakovich",
      "name": "Dmitri Shostakovich",
      "era": ["20th-21st Century"],
      "birthYear": 1906,
      "deathYear": 1975,
      "shortBio": "Dmitri Shostakovich was a Russian composer and pianist of the Soviet era. He is known for his symphonies, string quartets, and dramatic works. Shostakovich’s music reflects the turbulence and repression of 20th-century Russia.",
      "longBio": "Dmitri Shostakovich (1906–1975) was born in Saint Petersburg, Russia, and studied at the Petrograd Conservatory. He gained early fame with his First Symphony, composed at age 19. Shostakovich’s career was marked by complex relations with Soviet authorities, leading to periods of both acclaim and denunciation. His major works include 15 symphonies, 15 string quartets, and operas such as ‘Lady Macbeth of Mtsensk.’ Shostakovich’s music is noted for its emotional depth, irony, and use of musical codes. He also composed film scores, chamber music, and piano works. Shostakovich’s legacy endures as one of the most significant 20th-century composers. He was a master of multiple genres and a prolific composer. Shostakovich’s influence extends beyond classical music to film and popular music. He remains a celebrated figure in Russian cultural history. Shostakovich’s music continues to be performed and admired worldwide.",
      "nationality": "Russian",
      "location": "Saint Petersburg/Leningrad, USSR",
      "famousWorks": [
        "Symphony No. 5",
        "Symphony No. 7 'Leningrad'",
        "String Quartet No. 8"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/6/6c/%D0%94%D0%BC%D0%B8%D1%82%D1%80%D0%B8%D0%B9_%D0%94%D0%BC%D0%B8%D1%82%D1%80%D0%B8%D0%B5%D0%B2%D0%B8%D1%87_%D0%A8%D0%BE%D1%81%D1%82%D0%B0%D0%BA%D0%BE%D0%B2%D0%B8%D1%87.jpg"
    },
    {
      "id": "domenico-scarlatti",
      "name": "Domenico Scarlatti",
      "era": ["Baroque"],
      "birthYear": 1685,
      "deathYear": 1757,
      "shortBio": "Domenico Scarlatti was an Italian composer and harpsichordist of the Baroque period. He is best known for his 555 keyboard sonatas. Scarlatti’s works are celebrated for their virtuosity and inventiveness.",
      "longBio": "Domenico Scarlatti (1685–1757) was born in Naples, Italy, into a musical family; his father was composer Alessandro Scarlatti. He worked at various courts in Italy, Portugal, and Spain, serving as a music master and harpsichordist. Scarlatti composed over 555 keyboard sonatas, which are considered masterpieces of Baroque keyboard literature. His music is known for its bold harmonies, rhythmic vitality, and technical demands. Scarlatti’s style influenced both classical and later keyboard composers. He also wrote operas, sacred music, and chamber works. Scarlatti’s legacy remains central to the harpsichord and piano repertoire. He was a prolific composer, writing music in various genres. Scarlatti’s influence extends beyond the Baroque period to the Classical era. He was a master of the harpsichord and a celebrated composer of his time. Scarlatti’s music continues to be performed and admired today.",
      "nationality": "Italian",
      "location": "Madrid, Spain",
      "famousWorks": [
        "Keyboard Sonata in D minor, K.1",
        "Keyboard Sonata in E major, K.380",
        "Keyboard Sonata in G major, K.146"
      ],
      "imageUrl": "https://commons.wikimedia.org/wiki/Special:FilePath/Domenico_Scarlatti.jpg"
    },
    {
      "id": "elisabeth-jacquet-de-la-guerre",
      "name": "Elisabeth Jacquet de La Guerre",
      "era": ["Baroque"],
      "birthYear": 1665,
      "deathYear": 1729,
      "shortBio": "French harpsichordist and composer who was one of the few well-known female composers of her time.",
      "longBio": "Elisabeth Jacquet de La Guerre was a French musician, harpsichordist and composer. She was a child prodigy and performed at the court of Louis XIV. One of the few well-known female composers of her era, she was noted for her compositions for harpsichord, violin sonatas, and opera, being one of the first French women to compose operas.",
      "nationality": "French",
      "location": "Paris, France",
      "famousWorks": [
        "Céphale et Procris",
        "Suites for Harpsichord",
        "Sonates pour le Viollon"
      ],
      "imageUrl": "https://commons.wikimedia.org/wiki/Special:FilePath/Elisabeth_Jacquet_de_La_Guerre.jpg"
    },
    {
      "id": "erik-satie",
      "name": "Erik Satie",
      "era": ["20th-21st Century"],
      "birthYear": 1866,
      "deathYear": 1925,
      "shortBio": "French composer and pianist known for his unconventional and often humorous works.",
      "longBio": "Erik Satie was a French composer and pianist who was a leading figure in the early 20th century Parisian avant-garde. His work was a precursor to later artistic movements including minimalism, repetitive music, and the Theatre of the Absurd. He is best known for his piano pieces, particularly the Gymnopédies.",
      "nationality": "French",
      "location": "Paris, France",
      "famousWorks": [
        "Gymnopédies",
        "Gnossiennes",
        "Parade"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/58/Ericsatie.jpg"
    },
    {
      "id": "fanny-mendelssohn",
      "name": "Fanny Mendelssohn",
      "era": ["Romantic"],
      "birthYear": 1805,
      "deathYear": 1847,
      "shortBio": "Fanny Mendelssohn was a German composer and pianist of the Romantic era. She was the sister of Felix Mendelssohn and composed over 460 pieces, including songs, piano works, and chamber music. Despite societal constraints, she became a significant musical figure in her own right.",
      "longBio": "Fanny Mendelssohn (later Fanny Hensel) was born in Hamburg, Germany, in 1805. She demonstrated prodigious musical talent from an early age and received the same musical education as her brother Felix. Despite her abilities, she faced restrictions on publishing and performing due to the gender norms of her time. Fanny composed over 460 pieces, including lieder, piano works, and chamber music, with some published under her brother's name. She hosted influential salons in Berlin that became important musical gatherings. In 1846, she published her own works under her married name, Hensel. Fanny Mendelssohn’s legacy has grown, and she is now recognized as a pioneering female composer of the Romantic era.",
      "nationality": "German",
      "location": "Berlin, Germany",
      "famousWorks": [
        "Das Jahr",
        "Piano Trio in D minor",
        "Overture in C major"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Fanny_Hensel_1842.jpg"
    },
    {
      "id": "felix-mendelssohn",
      "name": "Felix Mendelssohn",
      "era": ["Romantic"],
      "birthYear": 1809,
      "deathYear": 1847,
      "shortBio": "Felix Mendelssohn was a German composer, pianist, organist, and conductor of the early Romantic period. He is known for his lyrical melodies and masterful orchestration. Mendelssohn founded the Leipzig Conservatory and revitalized interest in J.S. Bach’s music.",
      "longBio": "Felix Mendelssohn (1809–1847) was born in Hamburg, Germany, and grew up in a highly cultured family. He was a child prodigy, composing and performing from a young age. Mendelssohn’s works include symphonies, concertos, chamber music, and the famous ‘Wedding March’ from A Midsummer Night’s Dream. He played a key role in reviving the music of Johann Sebastian Bach, notably conducting the St. Matthew Passion in 1829. Mendelssohn founded the Leipzig Conservatory, shaping generations of musicians. His music is celebrated for its clarity, lyricism, and craftsmanship. Mendelssohn’s influence endures in both concert and educational spheres.",
      "nationality": "German",
      "location": "Leipzig, Germany",
      "famousWorks": [
        "A Midsummer Night's Dream",
        "Symphony No. 4 (Italian)",
        "Violin Concerto in E minor"
      ],
      "imageUrl": "https://commons.wikimedia.org/wiki/Special:FilePath/Felix_Mendelssohn_Bartholdy.jpg"
    },
    {
      "id": "francis-johnson",
      "name": "Francis Johnson",
      "era": ["Romantic"],
      "birthYear": 1792,
      "deathYear": 1844,
      "shortBio": "Francis Johnson was an African-American composer, bandleader, and virtuoso bugler and violinist. He was the first African-American composer to have his works published as sheet music. Johnson broke racial barriers by leading racially integrated concerts and ensembles in the United States and abroad.",
      "longBio": "Francis \"Frank\" Johnson (1792–1844) was born in Philadelphia, Pennsylvania. He became a prominent composer, bandleader, and performer, mastering both the bugle and violin. Johnson was the first African-American composer to publish sheet music and led one of the most popular bands in early 19th-century America. He performed for integrated audiences and toured internationally, including a notable visit to England. Johnson composed over 200 works, including marches, dances, and songs. His music blended European classical forms with African-American influences. Johnson’s pioneering achievements paved the way for future generations of Black musicians in America.",
      "nationality": "American",
      "location": "Philadelphia, USA",
      "famousWorks": [
        "Collection of New Cotillions",
        "The Princeton Grand March",
        "The Recognition March"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/c/c7/Frank_Johnson.jpg"
    },
    {
      "id": "franz-liszt",
      "name": "Franz Liszt",
      "era": ["Romantic"],
      "birthYear": 1811,
      "deathYear": 1886,
      "shortBio": "Franz Liszt was a Hungarian composer, virtuoso pianist, conductor, and teacher of the Romantic era. He was renowned for his dazzling piano technique and charismatic performances. Liszt was a key figure in the development of the symphonic poem and modern piano recital.",
      "longBio": "Franz Liszt (1811–1886) was born in Raiding, Hungary, and showed prodigious talent as a pianist from a young age. He toured Europe as a virtuoso, captivating audiences with his technical brilliance and expressive playing. Liszt composed innovative works for piano, orchestra, and voice, pioneering the symphonic poem genre. He was a generous teacher, mentoring many students and supporting other composers. Liszt’s later years were marked by religious devotion and experimentation with new musical forms. He was also known for his transcriptions and arrangements of other composers’ works. Liszt’s legacy endures as one of the most influential musicians of the 19th century.",
      "nationality": "Hungarian",
      "location": "Weimar, Germany",
      "famousWorks": [
        "Hungarian Rhapsodies",
        "Piano Sonata in B minor",
        "Liebestraum No. 3"
      ],
      "imageUrl": "https://commons.wikimedia.org/wiki/Special:FilePath/Franz_Liszt_2.jpg"
    },
    {
      "id": "franz-schubert",
      "name": "Franz Schubert",
      "era": ["Classical", "Romantic"],
      "birthYear": 1797,
      "deathYear": 1828,
      "shortBio": "Franz Schubert was an Austrian composer of the late Classical and early Romantic eras. He is renowned for his over 600 art songs, symphonies, and chamber music. Schubert’s music is celebrated for its lyricism, emotional depth, and melodic invention.",
      "longBio": "Franz Schubert (1797–1828) was born in Vienna, Austria, and displayed musical talent from an early age. He studied with Antonio Salieri and composed prolifically throughout his short life. Schubert wrote more than 600 lieder (art songs), as well as symphonies, piano music, and chamber works. His music blends Classical forms with Romantic expressiveness and innovation. Despite limited recognition during his lifetime, his works gained immense popularity after his death. Schubert’s ‘Unfinished Symphony’ and ‘Winterreise’ are among his most famous pieces. He is now regarded as one of the greatest composers in Western music history.",
      "nationality": "Austrian",
      "location": "Vienna, Austria",
      "famousWorks": [
        "Symphony No. 8 (Unfinished)",
        "Winterreise",
        "Ave Maria"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Franz_Schubert_by_Wilhelm_August_Rieder_1875.jpg/800px-Franz_Schubert_by_Wilhelm_August_Rieder_1875.jpg"
    },
    {
      "id": "george-bridgetower",
      "name": "George Bridgetower",
      "era": ["Classical", "Romantic"],
      "birthYear": 1778,
      "deathYear": 1860,
      "shortBio": "George Bridgetower was an Afro-European virtuoso violinist and composer. He was the original dedicatee and performer of Beethoven’s Kreutzer Sonata. Bridgetower’s career spanned royal courts and concert halls across Europe.",
      "longBio": "George Augustus Polgreen Bridgetower (1778–1860) was born in Poland to a West Indian father and European mother. He showed remarkable talent as a violinist from a young age and performed for European royalty, including the Prince of Wales. Bridgetower collaborated with Ludwig van Beethoven, premiering the Kreutzer Sonata, which was initially dedicated to him. He settled in England, where he became a respected performer and teacher. Bridgetower composed works for violin and piano, though few have survived. His career was marked by both acclaim and challenges due to his mixed heritage. Bridgetower’s story is an important part of classical music history.",
      "nationality": "Polish-West Indian",
      "location": "London, England",
      "famousWorks": [
        "Henry: A Ballad",
        "Diatonica Armonica",
        "Violin Performances with Beethoven"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/8/86/Bridgetower2.jpg"
    },
    {
      "id": "georg-philipp-telemann",
      "name": "Georg Philipp Telemann",
      "era": ["Baroque"],
      "birthYear": 1681,
      "deathYear": 1767,
      "shortBio": "Georg Philipp Telemann was a German Baroque composer and multi-instrumentalist. He is considered one of the most prolific composers in Western music history. Telemann’s works include church music, orchestral suites, and chamber pieces.",
      "longBio": "Georg Philipp Telemann (1681–1767) was born in Magdeburg, Germany. Largely self-taught, he defied his family’s wishes to pursue a career in music. Telemann composed over 3,000 works, including cantatas, oratorios, operas, orchestral suites, and chamber music. He served as music director in Frankfurt and later in Hamburg, where he influenced the city’s musical life for decades. Telemann’s style blended French, Italian, and German elements, and he was admired by contemporaries like Bach and Handel. His music was widely published and performed across Europe. Telemann’s legacy endures as a master of Baroque composition.",
      "nationality": "German",
      "location": "Hamburg, Germany",
      "famousWorks": [
        "Tafelmusik",
        "Paris Quartets",
        "Der Tag des Gerichts"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Telemann.jpg"
    },
    {
      "id": "gershwin",
      "name": "George Gershwin",
      "era": ["20th-21st Century"],
      "birthYear": 1898,
      "deathYear": 1937,
      "shortBio":
        "American composer and pianist who combined classical music with jazz influences in works like Rhapsody in Blue.",
      "longBio":
        "George Jacob Gershwin was an American composer and pianist whose compositions spanned both popular and classical genres. Among his best-known works are the orchestral compositions Rhapsody in Blue (1924) and An American in Paris (1928), the songs Swanee (1919) and Fascinating Rhythm (1924), the jazz standards I Got Rhythm (1930) and Embraceable You (1930), and the opera Porgy and Bess (1935), which gave birth to the hit Summertime. Gershwin studied piano under Charles Hambitzer and composition with Rubin Goldmark, Henry Cowell, and Joseph Brody. He began his career as a song plugger but soon started composing Broadway theater works with his brother Ira Gershwin and with Buddy DeSylva.",
      "nationality": "American",
      "location": "New York City, United States",
      "famousWorks": [
        "Rhapsody in Blue",
        "An American in Paris",
        "Porgy and Bess"
      ],
      "imageUrl":
        "https://upload.wikimedia.org/wikipedia/commons/7/72/Portrait_of_George_Gershwin_LCCN2004662906.jpg"
    },
    {
      "id": "giacomo-puccini",
      "name": "Giacomo Puccini",
      "era": ["Romantic"],
      "birthYear": 1858,
      "deathYear": 1924,
      "shortBio": "Giacomo Puccini was an Italian composer renowned for his operas. His works, such as La bohème, Tosca, and Madama Butterfly, are staples of the operatic repertoire. Puccini’s music is known for its lyricism, drama, and memorable melodies.",
      "longBio": "Giacomo Puccini (1858–1924) was born in Lucca, Italy, into a family of musicians. He studied at the Milan Conservatory and quickly established himself as a leading opera composer. Puccini’s operas are celebrated for their emotional intensity, rich orchestration, and vivid characterizations. His most famous works include La bohème, Tosca, Madama Butterfly, and Turandot. Puccini’s music blends Italian tradition with innovative harmonies and theatrical flair. He traveled widely and drew inspiration from diverse cultures for his operatic subjects. Puccini’s legacy endures as one of the greatest opera composers in history.",
      "nationality": "Italian",
      "location": "Lucca, Italy",
      "famousWorks": [
        "La bohème",
        "Madama Butterfly",
        "Tosca"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/9/9b/GiacomoPuccini.jpg"
    },
    {
      "id": "giuseppe-verdi",
      "name": "Giuseppe Verdi",
      "era": ["Romantic"],
      "birthYear": 1813,
      "deathYear": 1901,
      "shortBio": "Giuseppe Verdi was an Italian composer of the Romantic era, famed for his operas. His works, including Rigoletto, La traviata, and Aida, are among the most frequently performed worldwide. Verdi’s music is celebrated for its drama, melody, and emotional power.",
      "longBio": "Giuseppe Verdi (1813–1901) was born in Le Roncole, Italy, and rose from humble beginnings to become Italy’s leading opera composer. He achieved early success with operas like Nabucco and continued to innovate throughout his career. Verdi’s music is known for its memorable melodies, dramatic expression, and deep humanity. His operas, such as Rigoletto, Il trovatore, La traviata, and Aida, are staples of the repertoire. Verdi was also involved in Italian politics and became a symbol of the Risorgimento movement. He composed until late in life, with Falstaff as his final opera. Verdi’s influence on opera and Western music is profound and enduring.",
      "nationality": "Italian",
      "location": "Busseto, Italy",
      "famousWorks": [
        "Rigoletto",
        "La traviata",
        "Aida"
      ],
      "imageUrl": "https://commons.wikimedia.org/wiki/Special:FilePath/Giuseppe_Verdi.jpg"
    },
    {
      "id": "gustav-mahler",
      "name": "Gustav Mahler",
      "era": ["Romantic", "20th-21st Century"],
      "birthYear": 1860,
      "deathYear": 1911,
      "shortBio": "Gustav Mahler was an Austrian composer and conductor of the late Romantic and early modern eras. He is known for his expansive symphonies and deeply expressive song cycles. Mahler’s music bridges the 19th and 20th centuries with innovation and emotional depth.",
      "longBio": "Gustav Mahler (1860–1911) was born in Bohemia, then part of the Austrian Empire. He studied at the Vienna Conservatory and became one of the leading conductors of his time. Mahler composed nine symphonies and several song cycles, pushing the boundaries of orchestral and vocal music. His works are noted for their scale, complexity, and emotional range. Mahler served as director of the Vienna Court Opera and later worked in New York. His music was not fully appreciated until decades after his death. Today, Mahler is regarded as a pivotal figure in the transition from Romanticism to modernism.",
      "nationality": "Austrian",
      "location": "Vienna, Austria",
      "famousWorks": [
        "Symphony No. 2 (Resurrection)",
        "Symphony No. 5",
        "Das Lied von der Erde"
      ],
      "imageUrl": "https://commons.wikimedia.org/wiki/Special:FilePath/Photo_of_Gustav_Mahler_by_Moritz_N%C3%A4hr_01.jpg"
    },
    {
      "id": "hector-berlioz",
      "name": "Hector Berlioz",
      "era": ["Romantic"],
      "birthYear": 1803,
      "deathYear": 1869,
      "shortBio": "Hector Berlioz was a French Romantic composer renowned for his vivid orchestration and imaginative program music. He is best known for works like Symphonie fantastique. Berlioz's innovative techniques greatly influenced the development of the modern orchestra.",
      "longBio": "Hector Berlioz (1803–1869) was a leading French Romantic composer and conductor. He is celebrated for his bold orchestration and dramatic storytelling in music. His most famous work, Symphonie fantastique, broke new ground in programmatic composition. Berlioz authored the influential Treatise on Instrumentation, shaping orchestral practices for generations. He was known for employing massive orchestral forces in his performances. Despite facing mixed reception in France, he achieved great acclaim abroad, particularly in Germany and Russia. Berlioz's legacy endures as a pioneer of Romantic music and orchestration.",
      "nationality": "French",
      "location": "Paris, France",
      "famousWorks": [
        "Symphonie fantastique",
        "Les Troyens",
        "Harold en Italie"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/f/fd/Hector-Berlioz-1845.png"
    },
    {
      "id": "henry-purcell",
      "name": "Henry Purcell",
      "era": ["Baroque"],
      "birthYear": 1659,
      "deathYear": 1695,
      "shortBio": "Henry Purcell was an English Baroque composer renowned for his mastery of both sacred and secular music. He skillfully blended English traditions with Italian and French influences. Purcell is celebrated as one of Britain's greatest composers.",
      "longBio": "Henry Purcell (1659–1695) was a prominent English composer of the Baroque era. He served as organist at Westminster Abbey and the Chapel Royal. Purcell composed a wide range of music, including operas, odes, anthems, and chamber works. His opera Dido and Aeneas remains a cornerstone of English musical theater. He skillfully integrated continental styles into his music while maintaining a distinctly English character. Purcell's influence persisted long after his early death at age 36. He is widely regarded as one of the greatest English composers in history.",
      "nationality": "English",
      "location": "London, England",
      "famousWorks": [
        "Dido and Aeneas",
        "Come Ye Sons of Art",
        "Music for the Funeral of Queen Mary"
      ],
      "imageUrl": "https://commons.wikimedia.org/wiki/Special:FilePath/Henry_Purcell.jpg"
    },
    {
      "id": "hugo-wolf",
      "name": "Hugo Wolf",
      "era": ["Romantic"],
      "birthYear": 1860,
      "deathYear": 1903,
      "shortBio": "Hugo Wolf was an Austrian composer celebrated for his expressive art songs, or Lieder. He brought intense emotion and literary sensitivity to the genre. Wolf's works are considered masterpieces of late Romantic song literature.",
      "longBio": "Hugo Wolf (1860–1903) was an Austrian composer best known for his Lieder. He infused his songs with deep emotional intensity and close attention to the text. Wolf set the poetry of Goethe, Mörike, Eichendorff, and others to music with remarkable sensitivity. His cycles, such as the Mörike-Lieder and Spanisches Liederbuch, are highly regarded. Wolf struggled with mental illness, which affected his productivity in later years. Despite a relatively small output, his influence on song composition was profound. Wolf's music remains a touchstone for performers and lovers of German art song.",
      "nationality": "Austrian",
      "location": "Vienna, Austria",
      "famousWorks": [
        "Mörike-Lieder",
        "Spanisches Liederbuch",
        "Italienisches Liederbuch"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Hugo_Wolf.jpg"
    },
    {
      "id": "iannis-xenakis",
      "name": "Iannis Xenakis",
      "era": ["20th-21st Century"],
      "birthYear": 1922,
      "deathYear": 2001,
      "shortBio": "Iannis Xenakis was a Greek-French composer, architect, and music theorist. He pioneered the use of mathematics and architecture in musical composition. Xenakis's innovative works have had a lasting impact on contemporary music.",
      "longBio": "Iannis Xenakis (1922–2001) was a visionary Greek-French composer and architect. He fought in the Greek Resistance during World War II before moving to France. Xenakis studied composition with Olivier Messiaen and worked as an architect with Le Corbusier. He integrated mathematical concepts, such as stochastic processes, into his music. Notable works include Metastasis and Pithoprakta, which exemplify his unique approach. Xenakis also developed influential electronic and computer music techniques. His interdisciplinary legacy continues to inspire composers, architects, and theorists worldwide.",
      "nationality": "Greek-French",
      "location": "Paris, France",
      "famousWorks": [
        "Metastasis",
        "Pithoprakta",
        "Pleiades"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/58/XenakisMDaniel_crop.jpg"
    },
    {
      "id": "ignatius-sancho",
      "name": "Ignatius Sancho",
      "era": ["Classical"],
      "birthYear": 1729,
      "deathYear": 1780,
      "shortBio": "Ignatius Sancho was a British composer, writer, and abolitionist of African descent. Born on a slave ship, he became a prominent figure in 18th-century London. Sancho was the first known Black Briton to vote in a British election.",
      "longBio": "Ignatius Sancho (1729–1780) was born on a slave ship and orphaned as a child. He was brought to England, where he eventually gained his freedom. Sancho became a respected composer, actor, and writer in London society. He published collections of music, including minuets and dances, blending European and African influences. Sancho was also a vocal abolitionist and corresponded with many leading figures of his time. He made history as the first known person of African descent to vote in a British parliamentary election. Sancho's life and achievements remain a symbol of resilience and cultural contribution.",
      "nationality": "British",
      "location": "London, England",
      "famousWorks": [
        "Minuets, Cotillons & Country Dances",
        "A Collection of New Songs",
        "Twelve Country Dances for the Year 1779"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/3/38/Ignatius_Sancho%2C_1768.jpg"
    },
    {
      "id": "igor-stravinsky",
      "name": "Igor Stravinsky",
      "era": ["20th-21st Century"],
      "birthYear": 1882,
      "deathYear": 1971,
      "shortBio": "Igor Stravinsky was a Russian-born composer, pianist, and conductor. He is renowned for his revolutionary ballets and innovative musical styles. Stravinsky's work transformed 20th-century music and continues to influence composers today.",
      "longBio": "Igor Stravinsky (1882–1971) was one of the most influential composers of the 20th century. Born in Russia, he later became a French and then American citizen. Stravinsky gained international fame with ballets like The Firebird, Petrushka, and The Rite of Spring. The premiere of The Rite of Spring in 1913 caused a sensation with its bold rhythms and harmonies. He continually reinvented his style, exploring neoclassicism and serialism. Stravinsky collaborated with leading artists, choreographers, and writers of his era. His legacy endures in concert halls and ballet stages worldwide.",

      "nationality": "Russian-French-American",
      "location": "Various (Russia, France, USA)",
      "famousWorks": [
        "The Rite of Spring",
        "The Firebird",
        "Petrushka"
      ],
      "imageUrl": "https://commons.wikimedia.org/wiki/Special:FilePath/Igor_Stravinsky_LOC_32392u.jpg"
    },
    {
      "id": "jean-philippe-rameau",
      "name": "Jean-Philippe Rameau",
      "era": ["Baroque"],
      "birthYear": 1683,
      "deathYear": 1764,
      "shortBio": "Jean-Philippe Rameau was a leading French Baroque composer and music theorist. He is renowned for his operas and his influential Treatise on Harmony. Rameau's work shaped the development of Western classical music.",
      "longBio": "Jean-Philippe Rameau (1683–1764) was a pivotal figure in French Baroque music. He gained fame as a composer of operas, ballets, and harpsichord music. Rameau's Treatise on Harmony, published in 1722, revolutionized music theory. His stage works, such as Hippolyte et Aricie and Les Indes galantes, showcased innovative orchestration and harmony. Rameau's music was initially controversial but later celebrated for its originality. He also served as a court composer for King Louis XV. Today, Rameau is regarded as one of the greatest French composers and theorists.",
      "nationality": "French",
      "location": "Paris, France",
      "famousWorks": [
        "Hippolyte et Aricie",
        "Les Indes galantes",
        "Traité de l'harmonie"
      ],
      "imageUrl": "https://commons.wikimedia.org/wiki/Special:FilePath/Jean-Philippe_Rameau_by_Jacques_Aved.jpg"
    },
    {
      "id": "johann-sebastian-bach",
      "name": "Johann Sebastian Bach",
      "era": ["Baroque"],
      "birthYear": 1685,
      "deathYear": 1750,
      "shortBio": "Johann Sebastian Bach was a German Baroque composer and organist. He is celebrated for his mastery of counterpoint and profound sacred music. Bach's works remain central to Western classical music.",
      "longBio": "Johann Sebastian Bach (1685–1750) was one of the most influential composers of the Baroque era. He served as a church organist, court musician, and music director in various German cities. Bach composed an extensive body of work, including the Brandenburg Concertos, The Well-Tempered Clavier, and the St. Matthew Passion. His music is renowned for its complexity, expressive depth, and technical brilliance. Bach's innovative use of counterpoint and harmony set new standards in composition. Although underappreciated in his lifetime, his music was rediscovered in the 19th century. Today, Bach is revered as a master of Western music.",
      "nationality": "German",
      "location": "Leipzig, Germany",
      "famousWorks": [
        "Brandenburg Concertos",
        "The Well-Tempered Clavier",
        "St. Matthew Passion"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Johann_Sebastian_Bach.jpg"
    },
    {
      "id": "cage",
      "name": "John Cage",
      "era": ["20th-21st Century"],
      "birthYear": 1912,
      "deathYear": 1992,
      "shortBio": "John Cage was an American composer and pioneer of experimental music. He is known for his innovative use of chance and non-traditional instruments. Cage's ideas challenged the boundaries of what music could be.",
      "longBio": "John Cage (1912–1992) was a groundbreaking American composer, music theorist, and artist. He pioneered indeterminacy in music, using chance operations in composition and performance. Cage's best-known work, 4′33″, consists of performers not playing their instruments, highlighting ambient sound. He collaborated closely with choreographer Merce Cunningham, influencing modern dance. Cage also experimented with prepared piano and electronic music. His radical ideas reshaped 20th-century avant-garde music. Cage's legacy endures as a central figure in experimental and conceptual art.",
      "nationality": "American",
      "location": "New York City, United States",
      "famousWorks": ["4′33″", "Sonatas and Interludes", "Music of Changes"],
      "imageUrl":
        "https://upload.wikimedia.org/wikipedia/commons/2/23/John_Cage_%281988%29.jpg"
    },
    {
      "id": "george-frideric-handel",
      "name": "George Frideric Handel",
      "era": ["Baroque"],
      "birthYear": 1685,
      "deathYear": 1759,
      "shortBio": "George Frideric Handel was a German-British Baroque composer. He is celebrated for his operas, oratorios, and instrumental works. Handel's Messiah remains one of the most beloved choral pieces in history.",
      "longBio": "George Frideric Handel (1685–1759) was born in Germany and later became a British citizen. He achieved fame as a composer of Italian operas in London. Handel's oratorios, especially Messiah, are renowned for their dramatic power and memorable melodies. He also composed concerti grossi, organ concertos, and anthems. Handel's music blended German, Italian, and English influences. He was a prominent figure in London's musical life and enjoyed royal patronage. Handel's works are still widely performed and admired today.",
      "nationality": "German-British",
      "location": "London, England",
      "famousWorks": [
        "Messiah",
        "Water Music",
        "Music for the Royal Fireworks"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/f/fa/George_Frideric_Handel_by_Balthasar_Denner.jpg"
    },
    {
      "id": "antonio-vivaldi",
      "name": "Antonio Vivaldi",
      "era": ["Baroque"],
      "birthYear": 1678,
      "deathYear": 1741,
      "shortBio": "Antonio Vivaldi was an Italian Baroque composer, violinist, and priest. He is famous for his vibrant concertos and sacred choral music. Vivaldi's The Four Seasons is among the most popular pieces in classical music.",
      "longBio": "Antonio Vivaldi (1678–1741) was a prolific Italian composer and virtuoso violinist. Ordained as a priest, he was nicknamed 'The Red Priest' due to his hair color. Vivaldi composed over 500 concertos, many for the violin. His best-known work, The Four Seasons, vividly depicts scenes from nature. Vivaldi also wrote operas, sacred choral pieces, and chamber music. He spent much of his career working at a girls' orphanage in Venice, directing its renowned orchestra. Vivaldi's music fell into obscurity after his death but was revived in the 20th century.",
      "nationality": "Italian",
      "location": "Venice, Italy",
      "famousWorks": [
        "The Four Seasons",
        "Gloria",
        "L'Olimpiade"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Vivaldi.jpg"
    },
    {
      "id": "alessandro-scarlatti",
      "name": "Alessandro Scarlatti",
      "era": ["Baroque"],
      "birthYear": 1660,
      "deathYear": 1725,
      "shortBio": "Alessandro Scarlatti was an Italian Baroque composer and a key figure in the development of opera. He founded the Neapolitan school and composed over 60 operas. Scarlatti's influence shaped the evolution of Italian vocal music.",
      "longBio": "Alessandro Scarlatti (1660–1725) was a leading Italian composer of the Baroque era. He is best known for founding the Neapolitan school of opera. Scarlatti composed more than 60 operas and hundreds of cantatas. His works bridged early Baroque vocal styles and the emerging Classical tradition. Scarlatti's music is noted for its expressive melodies and dramatic flair. He was the father of Domenico Scarlatti, another renowned composer. Alessandro Scarlatti's legacy endures in both opera and sacred music.",

      "nationality": "Italian",
      "location": "Naples, Italy",
      "famousWorks": [
        "La Griselda",
        "Il Mitridate Eupatore",
        "Il Trionfo dell'Onore"
      ],
      "imageUrl": "https://commons.wikimedia.org/wiki/Special:FilePath/Alessandro_Scarlatti.jpg"
    },
    {
      "id": "robert-schumann",
      "name": "Robert Schumann",
      "era": ["Romantic"],
      "birthYear": 1810,
      "deathYear": 1856,
      "shortBio": "Robert Schumann was a German Romantic composer, pianist, and influential music critic. He is celebrated for his expressive piano music and lieder. Schumann's works and writings shaped 19th-century musical thought.",
      "longBio": "Robert Schumann (1810–1856) was a leading figure of the Romantic era in music. Originally aspiring to be a virtuoso pianist, he turned to composition after a hand injury. Schumann wrote extensively for piano, chamber ensembles, and orchestra. His lieder, or art songs, are particularly renowned for their poetic depth. He also founded the influential journal Neue Zeitschrift für Musik, shaping critical discourse. Schumann married the celebrated pianist Clara Wieck, who championed his music. His later years were marked by mental illness, but his legacy endures through his innovative and emotive works.",
      "nationality": "German",
      "location": "Düsseldorf, Germany",
      "famousWorks": ["Carnaval", "Kinderszenen", "Piano Concerto in A minor"],
      "imageUrl":
        "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Robert_Schumann_1839.jpg/800px-Robert_Schumann_1839.jpg"
    },
    {
      "id": "johann-strauss-ii",
      "name": "Johann Strauss II",
      "era": ["Romantic"],
      "birthYear": 1825,
      "deathYear": 1899,
      "shortBio": "Johann Strauss II was an Austrian composer known as 'The Waltz King.' He popularized the Viennese waltz in the 19th century. Strauss composed iconic works like 'The Blue Danube' and 'Die Fledermaus.'",
      "longBio": "Johann Strauss II (1825–1899) was the most famous member of the Strauss musical family. He composed over 500 waltzes, polkas, and other dance pieces, as well as operettas. Strauss's music became synonymous with the elegance and spirit of Vienna. His most celebrated waltz, 'The Blue Danube,' is recognized worldwide. Strauss also achieved success with operettas such as 'Die Fledermaus.' He was instrumental in elevating the waltz to the status of serious concert music. Strauss's legacy endures as a symbol of Viennese musical culture.",
      "nationality": "Austrian",
      "location": "Vienna, Austria",
      "famousWorks": [
        "The Blue Danube",
        "Tales from the Vienna Woods",
        "Die Fledermaus"
      ],
      "imageUrl":
        "https://upload.wikimedia.org/wikipedia/commons/6/67/Johann_Strauss_II_by_Fritz_Luckhardt.jpg"
    },
    {
      "id": "wolfgang-amadeus-mozart",
      "name": "Wolfgang Amadeus Mozart",
      "era": ["Classical"],
      "birthYear": 1756,
      "deathYear": 1791,
      "shortBio": "Wolfgang Amadeus Mozart was an Austrian Classical composer and child prodigy. He wrote over 600 works, including symphonies, operas, and chamber music. Mozart's genius and influence define the Classical era.",
      "longBio": "Wolfgang Amadeus Mozart (1756–1791) was one of the most gifted composers in history. Born in Salzburg, he displayed extraordinary musical talent from a young age. Mozart toured Europe as a child, performing for royalty and composing prolifically. His mature works include masterpieces such as 'The Magic Flute,' 'Symphony No. 41,' and 'Requiem.' Mozart excelled in every musical genre of his time, from opera to chamber music. He spent his later years in Vienna, where he achieved both fame and financial difficulties. Mozart's music remains a cornerstone of the Western classical tradition.",
      "nationality": "Austrian",
      "location": "Vienna, Austria",
      "famousWorks": [
        "The Magic Flute",
        "Symphony No. 40",
        "Requiem"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/1e/Wolfgang-amadeus-mozart_1.jpg"
    },
    {
      "id": "ludwig-van-beethoven",
      "name": "Ludwig van Beethoven",
      "era": ["Classical", "Romantic"],
      "birthYear": 1770,
      "deathYear": 1827,
      "shortBio": "Ludwig van Beethoven was a German composer and pianist who transformed Western music. He bridged the Classical and Romantic eras with his bold, innovative works. Beethoven continued to compose masterpieces even after losing his hearing.",
      "longBio": "Ludwig van Beethoven (1770–1827) is regarded as one of the greatest composers in history. He was born in Bonn and spent much of his career in Vienna. Beethoven's music marked the transition from the Classical to the Romantic era. His works include nine symphonies, piano sonatas, string quartets, and concertos. Beethoven began to lose his hearing in his late 20s but continued to compose groundbreaking music. His Ninth Symphony, with its 'Ode to Joy,' is a symbol of human aspiration. Beethoven's legacy endures as a revolutionary force in music.",
      "nationality": "German",
      "location": "Vienna, Austria",
      "famousWorks": [
        "Symphony No. 5 in C Minor",
        "Symphony No. 9 (Choral)",
        "Moonlight Sonata"
      ],
      "imageUrl": "https://commons.wikimedia.org/wiki/Special:FilePath/Beethoven.jpg"
    },
    {
      "id": "joseph-haydn",
      "name": "Joseph Haydn",
      "era": ["Classical"],
      "birthYear": 1732,
      "deathYear": 1809,
      "shortBio": "Joseph Haydn was an Austrian composer of the Classical period. He is known as the 'Father of the Symphony' and 'Father of the String Quartet.' Haydn's innovations shaped the course of Western music.",
      "longBio": "Joseph Haydn (1732–1809) was a key figure in the development of Classical music. He spent much of his career as court composer for the Esterházy family in Hungary. Haydn composed over 100 symphonies, numerous string quartets, and piano trios. His music established the formal structures of the symphony and string quartet. Haydn was a mentor to both Mozart and Beethoven. He was admired for his wit, inventiveness, and craftsmanship. Haydn's influence is evident in the works of generations of composers.",
      "nationality": "Austrian",
      "location": "Vienna, Austria",
      "famousWorks": [
        "The Creation",
        "Symphony No. 94 (Surprise)",
        "String Quartets Op. 76"
      ],
      "imageUrl": "https://commons.wikimedia.org/wiki/Special:FilePath/Joseph_Haydn.jpg"
    },
    {
      "id": "frederic-chopin",
      "name": "Frédéric Chopin",
      "era": ["Romantic"],
      "birthYear": 1810,
      "deathYear": 1849,
      "shortBio": "Frédéric Chopin was a Polish-French composer and virtuoso pianist of the Romantic era. He is renowned for his poetic and technically demanding piano works. Chopin's music remains central to the piano repertoire.",
      "longBio": "Frédéric Chopin (1810–1849) was a leading composer and pianist of the Romantic period. Born in Poland, he spent much of his adult life in Paris. Chopin wrote almost exclusively for solo piano, creating nocturnes, preludes, polonaises, and waltzes. His music is celebrated for its lyricism, expressive depth, and technical brilliance. Chopin was also admired as a performer, captivating audiences with his nuanced playing. He influenced generations of pianists and composers. Despite his early death, Chopin's works are beloved and frequently performed worldwide.",

      "nationality": "Polish-French",
      "location": "Paris, France",
      "famousWorks": [
        "Nocturnes",
        "Preludes",
        "Polonaises"
      ],
      "imageUrl": "https://commons.wikimedia.org/wiki/Special:FilePath/Frederic_Chopin_photo.jpeg"
    },
    {
      "id": "pyotr-ilyich-tchaikovsky",
      "name": "Pyotr Ilyich Tchaikovsky",
      "era": ["Romantic"],
      "birthYear": 1840,
      "deathYear": 1893,
      "shortBio": "Pyotr Ilyich Tchaikovsky was a Russian Romantic composer known for his expressive melodies and emotional depth. He wrote symphonies, concertos, operas, and ballets that are beloved worldwide. Tchaikovsky's music remains a cornerstone of the classical repertoire.",
      "longBio": "Pyotr Ilyich Tchaikovsky (1840–1893) was one of Russia's most celebrated composers. He studied at the Saint Petersburg Conservatory and later taught at the Moscow Conservatory. Tchaikovsky composed iconic works such as 'Swan Lake,' 'The Nutcracker,' and the '1812 Overture.' His music is noted for its lyricism, vivid orchestration, and emotional intensity. Despite professional success, he struggled with personal crises and depression. Tchaikovsky's openness to Western European influences set him apart from his Russian contemporaries. Today, his works are regularly performed and cherished worldwide.",
      "nationality": "Russian",
      "location": "Saint Petersburg, Russia",
      "famousWorks": [
        "The Nutcracker",
        "Swan Lake",
        "1812 Overture"
      ],
      "imageUrl": "https://commons.wikimedia.org/wiki/Special:FilePath/Portr%C3%A4t_des_Komponisten_Pjotr_I._Tschaikowski_%281840-1893%29.jpg"
    },
    {
      "id": "johannes-brahms",
      "name": "Johannes Brahms",
      "era": ["Romantic"],
      "birthYear": 1833,
      "deathYear": 1897,
      "shortBio": "Johannes Brahms was a German Romantic composer and pianist. He is renowned for his symphonies, chamber music, and choral works. Brahms's music blends classical tradition with deep emotional expression.",
      "longBio": "Johannes Brahms (1833–1897) was a leading composer of the Romantic period. Born in Hamburg, he spent much of his career in Vienna. Brahms wrote four symphonies, concertos, piano works, chamber music, and choral compositions. He is often grouped with Bach and Beethoven as one of the 'Three Bs' of classical music. Brahms was a master of counterpoint and structure, drawing inspiration from earlier composers. His friendship and artistic rivalry with Robert Schumann and Clara Schumann influenced his career. Brahms's music is admired for its depth, craftsmanship, and lyricism.",
      "nationality": "German",
      "location": "Vienna, Austria",
      "famousWorks": [
        "Symphony No. 4",
        "Ein deutsches Requiem",
        "Hungarian Dances"
      ],
      "imageUrl": "https://commons.wikimedia.org/wiki/Special:FilePath/JohannesBrahms.jpg"
    },
    {
      "id": "saariaho",
      "name": "Kaija Saariaho",
      "era": ["20th-21st Century"],
      "birthYear": 1952,
      "deathYear": 2023,
      "shortBio":
        "Kaija Saariaho was a Finnish composer renowned for her innovative blend of acoustic and electronic music. Her works are celebrated for their rich textures and spectral soundscapes. Saariaho was a leading figure in contemporary classical music.",
      "longBio":
      "Kaija Saariaho (1952–2023) was a pioneering Finnish composer whose music bridges the worlds of acoustic and electronic sound. She studied in Helsinki, Freiburg, and Paris, where she became associated with the spectralist movement. Saariaho was acclaimed for her unique timbral explorations and use of technology in composition. Her major works include the operas \"L'Amour de loin,\" \"Adriana Mater,\" and \"Only the Sound Remains.\" She also composed orchestral, chamber, and vocal music, often collaborating with leading performers and ensembles. Saariaho received numerous awards, including the Grawemeyer Award and the Polar Music Prize. Her legacy endures as one of the most influential voices in 21st-century music.",
      "nationality": "Finnish",
      "location": "Paris, France",
      "famousWorks": ["L'Amour de loin", "Graal théâtre", "D'Om le Vrai Sens"],
      "imageUrl":
        "https://upload.wikimedia.org/wikipedia/commons/2/2b/Kaija_Saariaho_in_2022.png"
    },
    {
      "id": "leonard-bernstein",
      "name": "Leonard Bernstein",
      "era": ["20th-21st Century"],
      "birthYear": 1918,
      "deathYear": 1990,
      "shortBio": "Leonard Bernstein was an American composer, conductor, pianist, and educator. He bridged classical and popular music with works like 'West Side Story.' Bernstein was a charismatic figure in 20th-century music.",
      "longBio": "Leonard Bernstein (1918–1990) was one of America's most influential musicians. He served as music director of the New York Philharmonic and conducted major orchestras worldwide. Bernstein composed symphonies, musicals, ballets, and film scores, including 'West Side Story' and 'Candide.' He was a passionate educator, known for his televised Young People's Concerts. Bernstein advocated for social justice and promoted American music internationally. His energetic conducting style and charisma made him a beloved public figure. Bernstein's legacy endures through his recordings, compositions, and educational work.",
      "nationality": "American",
      "location": "New York City, USA",
      "famousWorks": [
        "West Side Story",
        "Candide",
        "On the Town"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Leonard_Bernstein_1971.jpg"
    },
    {
      "id": "leo-delibes",
      "name": "Léo Delibes",
      "era": ["Romantic"],
      "birthYear": 1836,
      "deathYear": 1891,
      "shortBio": "Léo Delibes was a French Romantic composer known for his ballets and operas. He wrote the famous ballets 'Coppélia' and 'Sylvia.' Delibes's music is admired for its elegance and melodic charm.",
      "longBio": "Léo Delibes (1836–1891) was a prominent French composer of the Romantic era. He studied at the Paris Conservatoire and worked as a church organist. Delibes achieved fame with his ballets 'Coppélia' and 'Sylvia,' which remain staples of the repertoire. He also composed the opera 'Lakmé,' known for its 'Flower Duet.' Delibes's music is characterized by graceful melodies, colorful orchestration, and theatrical flair. He influenced later ballet composers, including Tchaikovsky. Delibes's works continue to enchant audiences worldwide.",
      "nationality": "French",
      "location": "Paris, France",
      "famousWorks": [
        "Coppélia",
        "Sylvia",
        "Lakmé"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/en/4/46/L%C3%A9o-Delibes-1875.png"
    },
    {
      "id": "luigi-boccherini",
      "name": "Luigi Boccherini",
      "era": ["Classical"],
      "birthYear": 1743,
      "deathYear": 1805,
      "shortBio": "Luigi Boccherini was an Italian Classical composer and virtuoso cellist. He is best known for his chamber music, especially string quintets. Boccherini's elegant style influenced the development of Classical music.",
      "longBio": "Luigi Boccherini (1743–1805) was a prolific Italian composer and cellist. He spent much of his career in Spain, serving at the court in Madrid. Boccherini wrote over 100 string quintets, pioneering the use of two cellos in the ensemble. His music is noted for its grace, lyricism, and refined Classical style. Boccherini also composed symphonies, concertos, and sacred music. His 'Minuet' from the String Quintet in E major is especially famous. Boccherini's works remain popular among chamber musicians and audiences.",
      "nationality": "Italian",
      "location": "Madrid, Spain",
      "famousWorks": [
        "String Quintet in E major (Minuet)",
        "Cello Concerto in B flat major",
        "Guitar Quintet No. 4 in D major"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/0/08/Luigi_Boccherini.jpg"
    },
    {
      "id": "manuel-de-falla",
      "name": "Manuel de Falla",
      "era": ["20th-21st Century"],
      "birthYear": 1876,
      "deathYear": 1946,
      "shortBio": "Manuel de Falla was a Spanish composer and one of the most important musicians of early 20th-century Spain. He blended Spanish folk traditions, especially Andalusian flamenco, with classical forms. Falla's works are celebrated for their vibrant rhythms and evocative melodies.",
      "longBio": "Manuel de Falla (1876–1946) was a leading Spanish composer of the early 20th century. Born in Cádiz, he was deeply influenced by Andalusian folk music and flamenco. Falla studied in Madrid and Paris, where he met Debussy and Ravel. His major works include 'The Three-Cornered Hat,' 'Nights in the Gardens of Spain,' and 'El amor brujo.' Falla's music is known for its rhythmic vitality, colorful orchestration, and Spanish character. He spent his later years in Argentina after the Spanish Civil War. Falla's legacy endures as a central figure in Spanish classical music.",
      "nationality": "Spanish",
      "location": "Granada, Spain",
      "famousWorks": [
        "The Three-Cornered Hat",
        "Nights in the Gardens of Spain",
        "El Amor Brujo"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/19/ManuelDeFalla.JPG"
    },
    {
      "id": "marianna-martines",
      "name": "Marianna Martines",
      "era": ["Classical"],
      "birthYear": 1744,
      "deathYear": 1812,
      "shortBio": "Marianna Martines was an Austrian composer, singer, and pianist of the Classical period. She was one of the few women to gain recognition in Vienna's musical society. Martines hosted influential salons attended by leading composers of her time.",
      "longBio": "Marianna Martines (1744–1812) was an Austrian composer, singer, and pianist. She studied with prominent teachers including Porpora and Haydn. Martines gained respect in Vienna's musical circles, a rare achievement for women in her era. She hosted regular musical salons that attracted figures like Mozart and Metastasio. Her compositions include masses, oratorios, motets, and keyboard sonatas. Martines was also a skilled performer, admired for her keyboard and vocal abilities. Her legacy highlights the contributions of women to Classical music.",
      "nationality": "Austrian",
      "location": "Vienna, Austria",
      "famousWorks": [
        "Dixit Dominus",
        "Il primo amore",
        "Keyboard Sonatas"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Marianna_Martines%2C_Pupil_of_P._Metastasio%3B_born_in_Vienna%2C_4th_day_of_May_1744%2C_Member_Academia_Filarmonica.jpg"
    },
    {
      "id": "maurice-ravel",
      "name": "Maurice Ravel",
      "era": ["20th-21st Century"],
      "birthYear": 1875,
      "deathYear": 1937,
      "shortBio": "Maurice Ravel was a French composer, pianist, and conductor known for his impressionistic style. He is celebrated for his innovative harmonies and masterful orchestration. Ravel's most famous work is the orchestral piece 'Boléro.'",
      "longBio": "Maurice Ravel (1875–1937) was a leading French composer of the early 20th century. He studied at the Paris Conservatoire and became associated with impressionism, though he rejected the label. Ravel's music is renowned for its clarity, precision, and inventive use of timbre. His works include orchestral pieces, piano music, chamber music, and operas. 'Boléro,' premiered in 1928, is his most popular composition. Ravel also composed 'Daphnis et Chloé' and 'Piano Concerto in G.' His influence extends beyond France, shaping modern orchestration and composition.",
      "nationality": "French",
      "location": "Paris, France",
      "famousWorks": [
        "Boléro",
        "Daphnis et Chloé",
        "Piano Concerto in G"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/7/78/Maurice_Ravel_1925.jpg"
    },
    {
      "id": "muzio-clementi",
      "name": "Muzio Clementi",
      "era": ["Classical"],
      "birthYear": 1752,
      "deathYear": 1832,
      "shortBio": "Muzio Clementi was an Italian composer, pianist, and teacher of the Classical period. He is best known for his piano sonatas and educational works. Clementi played a key role in the development of piano technique.",
      "longBio": "Muzio Clementi (1752–1832) was a prominent Italian composer and pianist. He spent much of his career in England, where he became a successful performer and teacher. Clementi composed piano sonatas, concertos, and symphonies, helping to shape the Classical piano repertoire. His 'Gradus ad Parnassum' is a landmark pedagogical work for pianists. Clementi was also a music publisher and piano manufacturer. He influenced later composers, including Beethoven. Clementi's contributions advanced both piano performance and composition.",
      "nationality": "Italian",
      "location": "Naples, Italy",
      "famousWorks": [
        "Piano Concerto in D minor",
        "Piano Sonata in G minor",
        "Piano Sonata in A minor"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/c/c9/Muzio_Clementi.jpeg"
    },
    {
      "id": "nikolai-rimsky-korsakov",
      "name": "Nikolai Rimsky-Korsakov",
      "era": ["Romantic"],
      "birthYear": 1844,
      "deathYear": 1908,
      "shortBio": "Nikolai Rimsky-Korsakov was a Russian composer of the Romantic period. He is renowned for his orchestral works and mastery of orchestration. Rimsky-Korsakov's music often draws on Russian folklore and legend.",
      "longBio": "Nikolai Rimsky-Korsakov (1844–1908) was a leading Russian composer and teacher. He was a member of 'The Five,' a group dedicated to creating a distinct Russian style. Rimsky-Korsakov wrote operas, symphonic works, and chamber music. His best-known pieces include 'Scheherazade,' 'Capriccio Espagnol,' and 'Flight of the Bumblebee.' He was celebrated for his brilliant orchestration and colorful harmonies. Rimsky-Korsakov taught many important Russian composers, such as Stravinsky and Prokofiev. His music remains a staple of the concert repertoire.",
      "nationality": "Russian",
      "location": "St. Petersburg, Russia",
      "famousWorks": [
        "Scheherazade",
        "Capriccio Espagnol",
        "Flight of the Bumblebee"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Walentin_Alexandrowitsch_Serow_004_%28cropped_3x4%29.jpg"
    },
    {
      "id": "reinhold-gliere",
      "name": "Reinhold Glière",
      "era": ["20th-21st Century"],
      "birthYear": 1875,
      "deathYear": 1956,
      "shortBio": "Reinhold Glière was a Soviet composer of German-Polish descent. He is known for his symphonies, ballets, and incorporation of folk elements. Glière taught many notable Russian composers.",
      "longBio": "Reinhold Glière (1875–1956) was a Russian and Soviet composer and teacher. He studied at the Moscow Conservatory and taught at both Kiev and Moscow. Glière's music blends Romantic style with Russian and Ukrainian folk influences. His major works include the ballet 'The Red Poppy' and Symphony No. 3 'Ilya Muromets.' Glière contributed to Soviet musical life as a teacher and administrator. He instructed composers like Prokofiev and Khachaturian. Glière's works are valued for their melodic richness and national character.",
      "nationality": "Russian",
      "location": "Kiev, Ukraine and Moscow, Russia",
      "famousWorks": [
        "Symphony No. 3 'Ilya Muromets'",
        "The Red Poppy",
        "Horn Concerto"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/21/Reinhold_Gli%C3%A8re.jpg"
    },
    {
      "id": "ricardo-castro",
      "name": "Ricardo Castro",
      "era": ["Romantic"],
      "birthYear": 1864,
      "deathYear": 1907,
      "shortBio": "Ricardo Castro was a Mexican pianist and composer of the Romantic era. He played a significant role in the development of classical music in Mexico. Castro's works blend European Romanticism with Mexican musical traditions.",
      "longBio": "Ricardo Castro (1864–1907) was a prominent Mexican composer and pianist. He studied at the National Conservatory of Music in Mexico City and later became its director. Castro gained international recognition for his virtuosic piano performances and compositions. His music combines Romantic style with Mexican folk elements, reflecting national identity. Castro composed piano concertos, orchestral works, and the opera 'Atzimba.' He promoted musical education and modernization in Mexico. Castro's legacy endures as a pioneer of Mexican classical music.",
      "nationality": "Mexican",
      "location": "Mexico City, Mexico",
      "famousWorks": [
        "Piano Concerto in A minor",
        "Vals Capricho",
        "Atzimba (opera)"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Ricardo-castro-herrera.jpg"
    },
    {
      "id": "richard-strauss",
      "name": "Richard Strauss",
      "era": ["Romantic", "20th-21st Century"],
      "birthYear": 1864,
      "deathYear": 1949,
      "shortBio": "Richard Strauss was a German composer and conductor active during the late Romantic and early modern eras. He is renowned for his tone poems and operas. Strauss's music is known for its rich orchestration and expressive power.",
      "longBio": "Richard Strauss (1864–1949) was a leading German composer and conductor. He wrote innovative tone poems such as 'Also sprach Zarathustra' and 'Don Juan.' Strauss's operas, including 'Salome' and 'Der Rosenkavalier,' expanded the expressive range of the genre. His music bridges the Romantic and modern eras, featuring complex harmonies and vivid orchestration. Strauss held prominent conducting positions in Germany and Austria. He navigated the challenges of two world wars and political upheaval. Strauss's works remain central to the orchestral and operatic repertoire.",
      "nationality": "German",
      "location": "Munich, Germany",
      "famousWorks": [
        "Also sprach Zarathustra",
        "Der Rosenkavalier",
        "Four Last Songs"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/c/c8/Max_Liebermann_Bildnis_Richard_Strauss.jpg"
    },
    {
      "id": "richard-wagner",
      "name": "Richard Wagner",
      "era": ["Romantic"],
      "birthYear": 1813,
      "deathYear": 1883,
      "shortBio": "Richard Wagner was a German composer, conductor, and theatre director of the Romantic era. He revolutionized opera with his concept of the Gesamtkunstwerk, or 'total work of art.' Wagner's music dramas are known for their complex harmonies and leitmotifs.",
      "longBio": "Richard Wagner (1813–1883) was a transformative figure in 19th-century music. He developed a new approach to opera, integrating music, drama, and visual spectacle. Wagner's major works include 'Der Ring des Nibelungen,' 'Tristan und Isolde,' and 'Parsifal.' His use of leitmotifs influenced generations of composers. Wagner built the Bayreuth Festspielhaus, a theatre dedicated to his works. His ideas and writings were controversial and influential in equal measure. Wagner's legacy shapes the course of Western classical music.",
      "nationality": "German",
      "location": "Bayreuth, Germany",
      "famousWorks": [
        "Der Ring des Nibelungen",
        "Tristan und Isolde",
        "Die Meistersinger von Nürnberg"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/9/9d/RichardWagner.jpg"
    },
    {
      "id": "ruth-crawford-seeger",
      "name": "Ruth Crawford Seeger",
      "era": ["20th-21st Century"],
      "birthYear": 1901,
      "deathYear": 1953,
      "shortBio": "Ruth Crawford Seeger was an American modernist composer and folk music specialist. She was the first woman to receive a Guggenheim Fellowship in composition. Crawford Seeger made significant contributions to American music scholarship.",
      "longBio": "Ruth Crawford Seeger (1901–1953) was a pioneering American composer and musicologist. She was associated with the 'ultramodernist' movement in early 20th-century American music. Crawford Seeger composed innovative works for piano, chamber ensembles, and voice. After marrying Charles Seeger, she became deeply involved in folk music research and transcription. She worked for the Library of Congress, preserving and arranging American folk songs. Crawford Seeger's legacy includes both her avant-garde compositions and her impact on American folk music. She remains a key figure in American musical history.",
      "nationality": "American",
      "location": "Washington, D.C., USA",
      "famousWorks": [
        "String Quartet 1931",
        "Piano Study in Mixed Accents",
        "Three Songs to Poems by Carl Sandburg"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/6/63/Ruth_Crawford_Seeger_early_1920s.jpg"
    },
    {
      "id": "samuel-coleridge-taylor",
      "name": "Samuel Coleridge-Taylor",
      "era": ["Romantic"],
      "birthYear": 1875,
      "deathYear": 1912,
      "shortBio": "Samuel Coleridge-Taylor was an English composer and conductor of the Romantic era. He achieved international fame for his choral work 'Hiawatha's Wedding Feast.' Coleridge-Taylor's music blends classical tradition with African and popular influences.",
      "longBio": "Samuel Coleridge-Taylor (1875–1912) was a distinguished English composer of mixed heritage. He studied at the Royal College of Music in London and gained early success with 'Hiawatha's Wedding Feast.' Coleridge-Taylor toured the United States, where he was celebrated by African American communities. His compositions include orchestral works, chamber music, and songs. He advocated for the recognition of Black musicians and composers. Coleridge-Taylor's music often incorporates elements of African and popular music. His legacy endures as a symbol of artistic achievement and cultural pride.",
      "nationality": "English",
      "location": "London, England",
      "famousWorks": [
        "Hiawatha's Wedding Feast",
        "Violin Concerto in G minor",
        "Petite Suite de Concert"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Samuel_Coleridge-Taylor.jpg"
    },
    {
      "id": "sergei-prokofiev",
      "name": "Sergei Prokofiev",
      "era": ["20th-21st Century"],
      "birthYear": 1891,
      "deathYear": 1953,
      "shortBio": "Sergei Prokofiev was a Russian composer, pianist, and conductor of the 20th century. He is celebrated for his innovative melodies, harmonies, and orchestration. Prokofiev's works include ballets, symphonies, and the beloved 'Peter and the Wolf.'",
      "longBio": "Sergei Prokofiev (1891–1953) was one of the most influential composers of the 20th century. He studied at the St. Petersburg Conservatory and quickly gained fame for his bold musical style. Prokofiev wrote across many genres, including symphonies, concertos, ballets, and operas. His best-known works include 'Romeo and Juliet,' 'Peter and the Wolf,' and the 'Classical Symphony.' After years abroad, he returned to the Soviet Union in 1936. Prokofiev's music is known for its rhythmic drive, lyricism, and wit. He left a lasting legacy in both Russian and international music.",
      "nationality": "Russian",
      "location": "Moscow, USSR",
      "famousWorks": [
        "Peter and the Wolf",
        "Romeo and Juliet",
        "Symphony No. 1 (Classical)"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/0/03/Sergei_Prokofiev_circa_1918_over_Chair_Bain.jpg"
    },
    {
      "id": "sergei-rachmaninoff",
      "name": "Sergei Rachmaninoff",
      "era": ["Romantic", "20th-21st Century"],
      "birthYear": 1873,
      "deathYear": 1943,
      "shortBio": "Sergei Rachmaninoff was a Russian composer, virtuoso pianist, and conductor of the late Romantic era. He is renowned for his sweeping melodies and expressive piano works. Rachmaninoff's music bridges Russian Romanticism and early 20th-century styles.",
      "longBio": "Sergei Rachmaninoff (1873–1943) was one of the last great Romantic composers. Born in Russia, he studied at the Moscow Conservatory and achieved early success with his piano and orchestral works. Rachmaninoff's career as a pianist and conductor brought him international acclaim. After the Russian Revolution, he emigrated to the United States, where he continued composing and performing. His major works include the 'Piano Concerto No. 2,' 'Rhapsody on a Theme of Paganini,' and 'Symphony No. 2.' Rachmaninoff's music is known for its lush harmonies, emotional depth, and technical brilliance. He remains a favorite among performers and audiences worldwide.",
      "nationality": "Russian",
      "location": "Beverly Hills, USA",
      "famousWorks": [
        "Piano Concerto No. 2",
        "Rhapsody on a Theme of Paganini",
        "Symphony No. 2"
      ],
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/b/be/Sergei_Rachmaninoff_cph.3a40575.jpg"
    }
  ]
}
